# Програма повинна вміти розділяти один список на два та помістити їх у новий список. Тобто,
# в результаті повинен вийти список із 2-х списків. Якщо в початковому списку непарна кількість
# елементів, то в першому списку має бути більше елементів. Якщо у списку немає елементів, то має
# бути створений список із двома порожніми списками. Важливо! Потрібно створити рішення, яке обробляє
# 3 випадки - список порожній, у списку парна кількість елементів і в списку непарна кількість елементів.

my_list = [1, 2, 3, 4, 5]
list_len_1, list_len_2 = divmod(len(my_list), 2)
if list_len_1 == 0 and list_len_2 == 0:
    my_list_new_1 = []
    my_list_new_2 = []
elif list_len_2 == 0:
    my_list_new_1 = my_list[0:list_len_1]
    my_list_new_2 = my_list[list_len_1:]
else:
    my_list_new_1 = my_list[0:list_len_1+1]
    my_list_new_2 = my_list[list_len_1+1:]
print(f"start list: {my_list}")
print(f"result list: {[my_list_new_1]+[my_list_new_2]}")
